" Устанавливает кодировку
set enc=utf-8

" Включает определение типа файла, загрузку соответствующих ему плагинов и файлов отступов
filetype plugin indent on

" Отключает обратную совместимость с Vi
set nocompatible

" Включает подсветку синтаксиса
syntax enable

" Устанавливает нумерацию строк
set number

" Устанавливает переключение paste mode на <F2>
set pastetoggle=<F2>

" Устанавливает ширину сдвига на 4 пробела
set shiftwidth=4

" Устанавливает ширину вкладки равной 4 столбцам
set tabstop=4

" Устанавливает символы пробела вместо табуляции
set expandtab

" Отключает сохранение резервных копий файлов
set nobackup

" Не позволяет курсору прокручиваться ниже или выше N строк при прокрутке
set scrolloff=10

" Отключает перенос длинных срок
set nowrap

" Во время поиска по файлу постепенно выделяет совпадающие символы по мере ввода
set incsearch

" Игнорирует заглавные буквы во время поиска
set ignorecase

" Показывает частичную команду, которую вы вводите в последней строке экрана
set showcmd

" Показывает режим, в котором вы находитесь на последней строке
set showmode

" Показывает совпадающие слова во время поиска
set showmatch

" Устанавливает подсветку при выполнении поиска
set hlsearch

" Устанавливает команды для сохранения в истории, число по умолчанию равно 20
set history=1000

" Включает меню автоматического завершения после нажатия кнопки TAB
set wildmenu

" Сделает так чтобы wildmenu вело себя также как и при завершении Bash
set wildmode=list:longest

" Есть определенные файлы, которые мы никогда не хотели бы редактировать с помощью Vim
" Wildmenu будет игнорировать файлы с этими расширениями.
set wildignore=*.docx,*.jpg,*.png,*.gif,*.pdf,*.pyc,*.exe,*.flv,*.img,*.xlsx

" PLUGINS ---------------------------------------------------------------- {{{

call plug#begin('~/.vim/plugged')

  Plug 'dense-analysis/ale'

  Plug 'preservim/nerdtree'

call plug#end()

" }}}

" MAPPINGS --------------------------------------------------------------- {{{

" Устанавливает обратный слэш в качестве ключевого слова 
" let mapleader = \

" Нажмите \\, чтобы вернуться к последнему положению курсора
nnoremap <leader>\ ``

" Введите jj, чтобы быстро выйти из режима вставки
inoremap jj <Esc>

" Нажмите пробел, чтобы ввести символ : в командном режиме
nnoremap <space> :

" Нажатие на букву 'o' откроет новую строку под текущей
" Выйдет из режима вставки после создания новой строки выше или ниже
" текущей строки.
nnoremap o o<esc>
nnoremap O O<esc>

" Центрируйте курсор по вертикали при переходе к следующему слову во время поиска
nnoremap n nzz
nnoremap N Nzz

" Копирование от курсора до конца строки
nnoremap Y y$

" Вы можете разделить окно в Vim, набрав :split или :vsplit
" Проще перемещаться по разделенному виду, нажимая CTRL +j, CTRL +k, CTRL +h или CTRL+l
nnoremap <c-j> <c-w>j
nnoremap <c-k> <c-w>k
nnoremap <c-h> <c-w>h
nnoremap <c-l> <c-w>l

" Измените размер разделенных окон с помощью клавиш со стрелками, нажав:
" CTRL+UP, CTRL+DOWN, CTRL+LEFT, и CTRL+RIGHT.
noremap <c-up> <c-w>+
noremap <c-down> <c-w>-
noremap <c-left> <c-w>>
noremap <c-right> <c-w><

" Настройки NERDTree.
" Нажмите клавишу F3 для переключения открытия и закрытия NERDTree
nnoremap <F3> :NERDTreeToggle<cr>

" Файлы которые игнорируются в меню так как не редактируются
let NERDTreeIgnore=['\.git$', '\.jpg$', '\.mp4$', '\.ogg$', '\.iso$', '\.pdf$', '\.pyc$', '\.odt$', '\.png$', '\.gif$', '\.db$']

" }}}

" VIMSCRIPT -------------------------------------------------------------- {{{

" Если текущий тип файла - HTML, устанавливается отступ в 2 пробела
autocmd Filetype html setlocal tabstop=2 shiftwidth=2 expandtab

" Если версия Vim равна или превышает 7.3, включите файл отмены
" Это позволяет вам отменить изменения в файле даже после его сохранения
if version >= 703
    set undodir=~/.vim/backup
    set undofile
    set undoreload=10000
endif

" Если запущена версия Vim с графическим интерфейсом, установите эти параметры 
if has('gui_running')

    " Установите фоновый тон
    set background=dark

    " Установите цветовую схему
    colorscheme molokai

    " Установите пользовательский шрифт, установленный на вашем компьютере
    " Синтаксис: <имя_ шрифта>\ <вес>\ <размер>
    set guifont=Monospace\ Regular\ 12

    " Скрыть панель инструментов
    set guioptions-=T

    " Скройте левую полосу прокрутки
    set guioptions-=L

    " Скройте правую полосу прокрутки
    set guioptions-=r

    " Скрыть строку меню
    set guioptions-=m

    " Скрыть нижнюю полосу прокрутки
    set guioptions-=b

    " Сопоставьте клавишу F4 для переключения меню, панели инструментов и полосы прокрутки
    " <Bar> - это символ канала
    " <CR> - это клавиша ввода
    nnoremap <F4> :if &guioptions=~#'mTr'<Bar>
        \set guioptions-=mTr<Bar>
        \else<Bar>
        \set guioptions+=mTr<Bar>
        \endif<CR>

endif

" }}}

" STATUS LINE ------------------------------------------------------------ {{{

" Очистить строку состояния при перезагрузке vimrc
set statusline=

" Строка состояния левая сторона
set statusline+=\ %F\ %M\ %Y\ %R

" Используйте разделитель, чтобы отделить левую сторону от правой
set statusline+=%=

" Строка состояния правая сторона
set statusline+=\ ascii:\ %b\ hex:\ 0x%B\ row:\ %l\ col:\ %c\ percent:\ %p%%

" Показать статус в предпоследней строке
set laststatus=2

" }}}
